tap "aovestdipaperino/tap"
tap "buo/cask-upgrade", trusted: true
tap "felixkratz/formulae", trusted: true
tap "kchromik/apps"
tap "nikitabobko/tap", trusted: true
tap "osx-cross/arm", trusted: true
tap "osx-cross/avr", trusted: true
tap "shaunsingh/sfmono-nerd-font-ligaturized", trusted: true
tap "steipete/tap", trusted: true
tap "zkondor/dist", trusted: true
# Command-line interface for SQLite
brew "sqlite"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Browser automation CLI for AI agents
brew "agent-browser"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Software library to render fonts
brew "freetype"
# Emacs dependency management
brew "cask"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Easy semantic versioning for projects using Git
brew "gitversion"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# Tool to report network interface bandwidth
brew "ifstat"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Development kit for the Java programming language
brew "openjdk"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Simple terminal UI for git commands
brew "lazygit"
# Sophisticated file transfer program
brew "lftp"
# Library for encoding and decoding .avif files
brew "libavif"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Development kit for the Java programming language
brew "openjdk@21"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tab completion for Python argparse
brew "python-argcomplete"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# File browser
brew "ranger"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# RC file (dotfile) management
brew "rcm"
# Fast, efficient and secure backup program
brew "restic"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# User interface to the TELNET protocol
brew "telnet"
# Markup-based typesetting system
brew "typst"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Tool for managing your YubiKey configuration
brew "ykman"
# Code intelligence tool that builds semantic knowledge graphs from source code
brew "aovestdipaperino/tap/tokensave", trusted: true
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Voice and text chat software
cask "discord"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-roboto"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Vector graphics editor
cask "inkscape"
# Java IDE by JetBrains
cask "intellij-idea"
# GPU-based terminal emulator
cask "kitty"
# Software for Logitech devices
cask "logi-options+"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Utility to extend trackpad functionality
cask "middleclick"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# GameStream client
cask "moonlight"
# Handy utility to manage and customize the notch area
cask "notchnook"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Android file transfer
cask "openmtp"
# Sound and audio controller
cask "proxy-audio-device"
# Control your tools with a few keystrokes
cask "raycast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Menu bar app that provides more control over Night Shift
cask "shifty"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Audio device utility
cask "soundanchor"
# Music streaming service
cask "spotify"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Menu bar speech-to-text powered by whisper.cpp, running entirely on-device
cask "kchromik/apps/whisperbar", trusted: true
# Network protocol analyzer
cask "wireshark-app"
# Full-featured companion app to the YubiKey
cask "yubico-authenticator"
mas "Amphetamine", id: 937984704
mas "AusweisApp", id: 948660805
mas "BikeControl", id: 6753721284
mas "Bitwarden", id: 1352778147
mas "Color Picker", id: 1545870783
mas "Command X", id: 6448461551
mas "Endurance", id: 1590043284
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "MyWhoosh", id: 1498889644
mas "Pure Paste", id: 1611378436
mas "Saber", id: 1671523739
mas "The Unarchiver 2", id: 425424353
mas "WireGuard", id: 1451685025
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "codezombiech.gitignore"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "tamasfe.even-better-toml"
vscode "yy0931.vscode-sqlite3-editor"
vscode "ziyasal.vscode-open-in-github"
uv "qmk", with: ["pip"]
npm "pnpm"
