tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "zkondor/dist"
brew "sqlite"
brew "zstd"
brew "tree"
brew "ansible"
brew "highway"
brew "aria2"
brew "bash"
brew "btop"
brew "freetype"
brew "cask"
brew "cmake"
brew "create-dmg"
brew "eza"
brew "fzf"
brew "gdu"
brew "git-delta"
brew "gitversion"
brew "gnupg"
brew "hopenpgp-tools"
brew "htop"
brew "ifstat"
brew "jq"
brew "openjdk"
brew "ktlint"
brew "lazygit"
brew "libavif"
brew "lsusb"
brew "lua"
brew "luarocks"
brew "mas"
brew "maven"
brew "ninja"
brew "python@3.13"
brew "nmap"
brew "node"
brew "nowplaying-cli"
brew "pango"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "python@3.11"
brew "qt@5"
brew "ranger"
brew "rbenv"
brew "rclone"
brew "rcm"
brew "restic"
brew "sevenzip"
brew "starship"
brew "switchaudio-osx"
brew "telnet"
brew "unar"
brew "vim"
brew "wget"
brew "xcbeautify"
brew "ykman"
brew "ykpers"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "aerospace"
cask "aldente"
cask "alt-tab"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "autodesk-fusion"
cask "discord"
cask "elgato-camera-hub"
cask "eqmac"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "garmin-express"
cask "gimp"
cask "hiddenbar"
cask "inkscape"
cask "jellyfin-media-player"
cask "kitty"
cask "logi-options+"
cask "middleclick"
cask "miniconda"
cask "monitorcontrol"
cask "moonlight"
cask "notchnook"
cask "notunes"
cask "proxy-audio-device"
cask "prusaslicer"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "raycast"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "soapui"
cask "soundanchor"
cask "spotify"
cask "stolendata-mpv"
cask "suspicious-package"
cask "the-unarchiver"
cask "tigervnc-viewer"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "yubico-authenticator"
cask "znotch"
mas "Amphetamine", id: 937984704
mas "AusweisApp", id: 948660805
mas "Bitwarden", id: 1352778147
mas "Color Picker", id: 1545870783
mas "Command X", id: 6448461551
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pure Paste", id: 1611378436
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "alefragnani.project-manager"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "ciantic.keymapceditor-vsc"
vscode "codezombiech.gitignore"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lukevan.qmk-action-button"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "xaver.clang-format"
vscode "yy0931.vscode-sqlite3-editor"
vscode "ziyasal.vscode-open-in-github"
